{
      "videoDetails": {
            "VideoLink": "https://www.youtube.com/watch?v=6dmIlF3yIPg",
            "ChannelLink": "https://www.youtube.com/channel/UCQRFZiQCyfP5VR1nm9zX3lA",
            "VideoId": "6dmIlF3yIPg",
            "ChannelId": "UCQRFZiQCyfP5VR1nm9zX3lA",
            "Title": "😂 Funniest Cats and Dogs Videos 😺🐶 || 🥰😹 Hilarious Animal Compilation №437",
            "ChannelName": "Animal Zone",
            "Description": "Enjoy the hilarity of funny animals in Compilation number 1, featuring only the finest selection! Relax and soak up the positive vibes 😉 Watch amusing videos of various funny animals, including funny cats, dogs, and more.\n\n🙏🏻 If you enjoyed the content, consider subscribing, liking, leaving comments, and sharing with your friends.\n\n🔔 Don't forget to enable notifications for the channel to ensure you never miss our amusing animal videos, updated weekly!\n\n⚠️ Our goal in creating compilations is not to plagiarize other people's videos, but to share them in high-quality compilations with a wider audience.\n\nEnjoy a variety of funny animal videos, including funny cats, funny dogs, and other hilarious animals.\n\n⚠️ We acknowledge that all copyrights belong to their respective legal owners. If you are the rightful owner of a video featured in our content and believe its distribution infringes upon your copyright, please contact us. We are committed to removing the clip or reaching an agreement with you. Thank you.\n\nAnimal Zone is a channel dedicated to entertaining collections of funny videos, featuring adorable cats, dogs, and various other funny animals. Our aim is to bring more positive and joyful moments into your life! Expect new funny cat (and other funny animal) videos every week. Don't forget to subscribe, invite your friends, and embrace the positive vibes!\n\n______________________\nfunny animal videos,funny animal video,best animal videos,funny dog videos,funny cat videos,funny animals life,funny animal moments,funny animals 2022,funny animals,cute dogs and cats,funny videos,funniest dogs,funniest animals,dog videos,cat videos,funny video,animals life,cute funny cat,funny cats,funny dogs,cute videos,cute animals,cutest cats compilation,funny cat,funny dog,awesome animals,cute and funny dog,try not to laugh animals,puppies,dogs funny videos,kittens,funny animals cats and dogs,puppies and kittens,cats meowing,cats videos,dogs videos"
      },
      "stats": {
            "ViewCount": 48514,
            "LikeCount": 363,
            "CommentCount": 16,
            "Like2ViewRatio": 0.007482376221296945,
            "Comment2ViewRatio": 0.0003298017067238323,
            "Tags": [
                  "funny animal videos"
            ]
      }
}