{
      "videoDetails": {
            "VideoLink": "https://www.youtube.com/watch?v=_QwSjNkjlXo",
            "ChannelLink": "https://www.youtube.com/channel/UCyggFWfcMy_gqdw9d_6VjOg",
            "VideoId": "_QwSjNkjlXo",
            "ChannelId": "UCyggFWfcMy_gqdw9d_6VjOg",
            "Title": "War Thunder: A General Guide to Air Realistic Battles",
            "ChannelName": "Nimbosoup",
            "Description": "Once again, as promised to a few of you supporters last video, I'm back with a guide to Air RB! This is geared towards beginner players, but just because you're experienced doesn't mean you won't also learn something! Of course, it's extremely difficult to fit all the stuff you might need to know to succeed into one video; comment if, in the future, you'd like to see me break this video down more! \n\nI hope you enjoyed the video! Please like, subscribe, and comment any feedback or future content you might want to see from me! Also, check out my last video if you're struggling to grind in War Thunder :)\n\nJust need to take a minute to say thank you guys for the INSANE support on last video! I had a feeling that video would be my start, and alas, it's been a wild ride so far. Shout out to all you new fans not from the stream, but an even bigger shoutout if you're from the stream! If you wanna be a part of that crew, come tune in :) \n\nhttps://www.twitch.tv/nimbosoup\n\nAlso, join my discord server! Get notified with new content, streams going live, find war thunder squadmates, advice, memes, etc! \n\nhttps://discord.gg/M2Hw3MXUj6\n\n0:00 Introduction\n0:58 Setup\n2:33 Prop Planes\n4:32 Jet Planes\n5:38 Missiles\n7:28 Radar\n8:28 After Thoughts\n9:46 Outro"
      },
      "stats": {
            "ViewCount": 10159,
            "LikeCount": 355,
            "CommentCount": 44,
            "Like2ViewRatio": 0.0349443842897923,
            "Comment2ViewRatio": 0.004331134954227778,
            "Tags": [
                  "war thunder"
            ]
      }
}