{
      "videoDetails": {
            "VideoLink": "https://www.youtube.com/watch?v=D9zq7NBAzl8",
            "ChannelLink": "https://www.youtube.com/channel/UCQHqC6vRv62d8QC_AmEu4fQ",
            "VideoId": "D9zq7NBAzl8",
            "ChannelId": "UCQHqC6vRv62d8QC_AmEu4fQ",
            "Title": "F6F5 TINY TIM Rockets  Hellcat CAS  War Thunder Ground Realistic Battles",
            "ChannelName": "hav3nWT",
            "Description": "Welcome back, YouTube. Hav3nWT here today we're taking out Tiny Tims. And I gotta admit, Tiny Tims, they're kind of a hard sell. Like you can take 'em out on the hellcat. But you know what else? The hellcat can take out. The whole cat can take out a whole bunch of bombs and HVARs at the same time. So, tiny Tims, let's talk about them.\n\nWhat are we doing with them? Now, if you're unaware of what a Tiny Tim is, Tiny Tim is a giant rocket. And to be honest, they're kind of hard to use. I have gotten pretty good with the HVARs. Anybody who can mash the space bar can get pretty good with bombs. So the tiny Tims were sort of another unique challenge to me.\n\nI really enjoyed the B-25J orbital strike video, and I wanted to challenge myself again. Another huge shoutout to the @CrabbyPattyMoox. Go check out his video. He really kind of laid out the gauntlet as to the challenge around these tiny Tims.\n\nI thought I'd give it a shot. And once I did it, I was kind of hooked. I did not get the longest shots with the tiny Tims, but I think, well, we had pretty good success, and I'll show you that here in a minute. The thing about the tiny Tims is, essentially, it is a bomb with a rocket motor at the back of it. They explode way bigger than what you might think. They're way different from HVARs in aiming and capability. And to be honest, they're just kind of an odd rocket.\n\nBut we're going to take it out today, we're going to have fun with it. We're going to see what we can do with it and see where they're useful. Oh, and, by the way, it's on the hellcat. The hellcat is just a fantastic CAS option in general. If you skipped over it because it's not good in air battles, which I kind of did, it's actually not even bad. And in air battles, if you know how to play it, regardless, it is a fantastic CAS machine. You can set up some crazy loadouts. You can get three independent 1000-pound bomb drops. You can do this sort of mixed HVAR and thousand pounders. It's a great option. Come back and look at any plus. Of course, it always gets the American fifty cals.\n\nIf you have another challenge like this, you help me check out and want me to try, leave it in the comment section, and I'll get to it. If it's not too miserable. If it's too miserable, I'm going to tell you to go do it yourself. But if you've got another challenge, you think I should try leaving the comments, and I'm going to get around to it, because these are quite fun challenges.\n\n#warthundergameplay #warthunder #warthunderrealisticbattle"
      },
      "stats": {
            "ViewCount": 1055,
            "LikeCount": 36,
            "CommentCount": 9,
            "Like2ViewRatio": 0.034123222748815164,
            "Comment2ViewRatio": 0.008530805687203791,
            "Tags": []
      }
}