{
      "videoDetails": {
            "VideoLink": "https://www.youtube.com/watch?v=eZ681-4y3_M",
            "ChannelLink": "https://www.youtube.com/channel/UC35fEXSE9nGklLAVkf_glNw",
            "VideoId": "eZ681-4y3_M",
            "ChannelId": "UC35fEXSE9nGklLAVkf_glNw",
            "Title": "How I made Math: Final Boss",
            "ChannelName": "Jake Walker",
            "Description": "Here it is. The video I’ve been working on for 5 months. Here’s how I made a deity of math in the Desmos graphing calculator. This video’s a bit fast-paced, so feel free to pause and read some of the notes I put throughout the video if you want more details. Otherwise, sit back and watch the fireworks as I explain everything that went into making this massive graph.\nThis video might be the most ambitious project I’ve ever made. It may not look like much considering it’s only 16 minutes long, but putting together all the animations and effects was a nightmare. I also ended up having to start all over at one point because I just didn’t like the direction it was going. \nI even made a custom boss theme for the opening animation section. I was originally going to use Twisted Garden for it but then decided to make my own theme for it. I should have a full song ready at some point but I’ll have to see where my motivation takes me for that. \nFactoring in everything I wouldn’t be surprised if this video took me over 100 hours to make. Hopefully videos won’t take me that long to make in the future. Hope you enjoy it!\n\nChapters:\n0:00 Intro\n0:54 Parametrics, Polygons, and Colors\n2:01 Helpful Functions\n2:56 Mountain Background\n3:13 Lists\n3:41 Rest of Mountain Background\n4:16 Stars and Planets\n5:09 Unit Circle Background\n5:46 Black Hole\n6:08 Flower Body and Vines\n6:45 Eye\n7:08 Math Runes\n8:29 Arms\n9:10 Wings\n11:17 Floating Rocks (and Lens Flare)\n12:11 Foreground Cliffs and Signature\n12:58 Optimizations\n13:37 Creating Image Mode\n14:27 Error Optimization\n15:43 Outro\n\n\nSONGS USED:\nMatt Sexton - kevintechnospam.bin (Celeste: Strawberry Jam OST)\nJake Walker - Math Final Boss Theme (This is still a work in progress by the way)\nWangled Teb - Jackhammer Jamboree (Celeste: Strawberry Jam OST)\nKAERRA - ORB POWER (Celeste: Strawberry Jam OST)\nToby Fox - Field of Hopes and Dreams (Deltarune OST)\nCeph - Gym Jams (Celeste: Strawberry Jam OST)\nTyKim - Flying Lanterns (Celeste: Strawberry Jam OST)\nDM Dokuro - Infestation (Terraria: Calamity OST)\nLena Raine - wavedash.ppt (Celeste OST)\nOriginal Kyle - Limitless (Celeste: Strawberry Jam OST)\nWangled Teb - Home on the Range (Celeste: Strawberry Jam OST)\nminecire - Bluebird (Celeste: Strawberry Jam OST)\nDM Dokuro - Fly of Beelzebub (Terraria: Calamity OST)\nLena Raine - Reach for the Summit (Celeste OST)\nMagnus Pålsson - Potential for Anything (VVVVVV OST)\nJake Walker - The Starmaker (This one is also a work in progress)"
      },
      "stats": {
            "ViewCount": 456718,
            "LikeCount": 23547,
            "CommentCount": 894,
            "Like2ViewRatio": 0.051556978266676594,
            "Comment2ViewRatio": 0.001957444199703099,
            "Tags": []
      }
}