{
      "videoDetails": {
            "VideoLink": "https://www.youtube.com/watch?v=h2o2oGfQEa0",
            "ChannelLink": "https://www.youtube.com/channel/UC3YQqEU2ENqsDT19cutChFA",
            "VideoId": "h2o2oGfQEa0",
            "ChannelId": "UC3YQqEU2ENqsDT19cutChFA",
            "Title": "Former Flight Instructor teaches you the basics of War Thunder Simulator controls",
            "ChannelName": "Pilot Pug",
            "Description": "Wanted to do this video for a while and when someone asked for it, I figured it was time!\n0:00 Disclaimer and intro.\n0:50 Controls\n1:56 Engine start and P-Factor\n2:34 Take-off\n3:47 Spins\n5:28 Counter rotating props (recommendation!)\n7:27 Outro\n\nWatched until the end for some neat aspect of the P-38 Lightning\n___________________________________________________\nWar Thunder is a free-to-play vehicular combat multiplayer video game developed and published by Gaijin Entertainment. Announced in 2011, it was first released in November 2012 as an open beta with a worldwide release in January 2013; it had its official release on 21 December 2016. It has a cross-platform format for Microsoft Windows, macOS, Linux, PlayStation 4, Xbox One, PlayStation 5, Xbox Series X, Xbox Series S, Oculus, and Vive. A spinoff game called War Thunder Mobile (also known as War Thunder Edge) was released in May 2023 for Android, with an iOS version released in August 2023.\n\nDeveloped as a \"flying simulation game\", it was previously named War Thunder: World of Planes,but due to its similarity with Wargaming's World of Warplanes, it was changed to its present name in 2012. Initially, Gaijin claimed after the game was announced that it was an April Fools joke before confirming its existence in June that same year.\n\nWar Thunder won several awards following its release, winning Best Simulation Game at the Gamescom 2013 Awards as well as winning Best Game, Best Developer, Best Technology and Best Sound at the KRI 2013 Awards. In 2019, War Thunder was among the most played games on Steam with over 25,000 concurrent players on Steam only. In 2023, the number of people playing War Thunder simultaneously on Steam only was over 75,000 on average and peaked at 114,806 on Nov 05, 2023. These numbers do not include console players or PC players using the Gaijin.net service.\n\nAs of November 1, 2022, War Thunder had over 70 million registered players on all platforms combined, out of which 160,000 play concurrently.\nWar Thunder is based around combined arms battles on air, land, and sea. Vehicles range from pre-World War I (ships only) to modern day with an emphasis on World War II, the Vietnam War, and the Cold War. Players can control aircraft, ground vehicles, and warships from ten nations with a set of trees attached to them: United States, Germany, Russia, Britain, France, Japan, Italy, China, Sweden and Israel. The game also incorporates other nations, including Argentina, Australia, Austria, Bangladesh, Belarus,Canada, Czechoslovakia, Finland, Hungary, India, Kazakhstan, North Korea, Philippines, Poland, Portugal, Romania, South Africa, Spain, Switzerland, Turkey, and Vietnam. These nations are included either as \"sub-trees\" (parts of the research trees of bigger nations being dedicated to a smaller nation) or premium vehicles, purchasable with real money or in-game currency.\n\nVehicles are divided into three main categories: aviation, ground, and fleet, while game modes are divided between arcade, realistic, and simulator. Aviation is divided between fixed-wing aircraft and helicopters, fleet is divided between \"Bluewater\" and \"Coastal\". A single-player mode that focuses on historical battles, and a co-op wave survival mode for battling AI ground vehicles and aircraft, are also available.\n\nTags:\nshort, shorts, wt short, wt shorts, war thunder short, war thunder shorts, sim, wt, war thunder, ac7, ace combat, wt gameplay, war thunder gameplay, wt meme, war thunder meme, meme, Enduring Confrontation, sim dogfights, air sim, aviation, flightsim, flying sim, dcs, pilot stuff, avgeek, aviation geek, acm, air combat maneuvering,  dogfighting, dogfight, dogfights, sim dogfights, war thunder best premium planes, how to grind war thunder planes, pilot plays war thunder, war thunder simulator battles, war thunder tips,"
      },
      "stats": {
            "ViewCount": "70",
            "LikeCount": "8",
            "CommentCount": 4,
            "Like2ViewRatio": 0.11428571428571428,
            "Comment2ViewRatio": 0.05714285714285714,
            "Tags": [
                  [
                        "sim",
                        "wt",
                        "war thunder",
                        "ac7",
                        "ace combat",
                        "wt gameplay",
                        "war thunder gameplay",
                        "wt meme",
                        "war thunder meme",
                        "meme",
                        "sim dogfights",
                        "air sim",
                        "aviation",
                        "flightsim",
                        "flying sim",
                        "dcs",
                        "pilot stuff",
                        "avgeek",
                        "aviation geek",
                        "acm",
                        "dogfighting",
                        "dogfight",
                        "dogfights",
                        "pilot plays war thunder",
                        "war thunder simulator battles",
                        "war thunder tips",
                        "how to play war thunder simulator",
                        "war thunder simulator controls",
                        "P-38",
                        "p38",
                        "lightning",
                        "p38 lightning",
                        "war thunder p38",
                        "p51",
                        "P-51",
                        "P-38 lightning",
                        "war thunder lightning"
                  ]
            ]
      }
}