{
      "videoDetails": {
            "VideoLink": "https://www.youtube.com/watch?v=ygoVfEJdmj0",
            "ChannelLink": "https://www.youtube.com/channel/UCyggFWfcMy_gqdw9d_6VjOg",
            "VideoId": "ygoVfEJdmj0",
            "ChannelId": "UCyggFWfcMy_gqdw9d_6VjOg",
            "Title": "War Thunder: How to Grind Low Tiers EASILY",
            "ChannelName": "Nimbosoup",
            "Description": "SOUP SQUAAAAAAD!!!! I'm back with another video! This time, it's how to grind through low tiers in war thunder as best as YOU can. Keep in mind, it's different for everyone- nobody can be good at everything. The point of this video is to set you up properly, give you some tips and ideas you can use and/or build upon, and let you go experiment for yourself to see what works for you! If you're looking for more specific methods and you didn't happen to understand the point of this video, I'll give you the TLDR- the best method you can use is whatever works best for YOU, it just takes some experimenting. Test out what I told you, build upon it depending on your play style, and succeed!\n\nI gave you some methods and tips in the video and I'm SURE the comments will be filled with even more, so there's plenty of resources for you TO succeed. Catch me on my discord server (linked below) if I don't reply to your comment with any more questions about strategies or ways to implement them you might have! There's plenty of very high skilled players in there to answer questions, too :)\n\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nIf you liked the video, or learned anything, please leave a like, a comment letting me know what you liked or learned, and consider subscribing & checking out my other content! \n\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nIf you need extra pointers, or want to learn from players with lots of experience, join the discord server! War Thunder help channels included :) https://discord.gg/M2Hw3MXUj6\n\n -----------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nCatch me live on stream! (Live right after this uploads!) We have tons of fun :) https://www.twitch.tv/nimbosoup\n\n=================================================================================\n\nCHAPTERS:\n0:00 INTRO\n1:14 I. PREMIUM\n3:30 II. GAMEMODES & VEHICLES\n5:46 III. EXPERIMENTATION\n8:04 IV. SPECIALS\n8:47 V. IMPROVING YOUR GAMEPLAY\n9:48 VI. SOME STUFF TO TRY\n12:39 VII. CONCLUSION"
      },
      "stats": {
            "ViewCount": "53119",
            "LikeCount": "1324",
            "CommentCount": 78,
            "Like2ViewRatio": 0.024925168018976263,
            "Comment2ViewRatio": 0.0014684011370695985,
            "Tags": []
      }
}